---
kind: type
id: T:Autodesk.Revit.DB.Transform2D
source: html/49a13f08-08d7-95b1-d52e-65f90e6d4061.htm
---
# Autodesk.Revit.DB.Transform2D

An affine transform of 2D Euclidean space.

## Syntax (C#)
```csharp
public class Transform2D : IDisposable
```

## Remarks
An affine transform is a linear transform plus a translation (which may be zero).
 Some functions only accept certain kinds of transform (e.g., rigid motion, conformal, non-singular, etc.).